---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LoadFailures.LineLoadNotOverlappingHost
source: html/a34153fe-0b3f-c686-ddd7-2f6e7ccc1bed.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LoadFailures.LineLoadNotOverlappingHost Property

Line load is not overlapping with its entire distribution its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId LineLoadNotOverlappingHost { get; }
```